In [55]:
#Connect to the database

In [44]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [45]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [56]:
#Get the first 5 rows

In [46]:
%%sql
SELECT *
    FROM facts
    LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [57]:
#Get summary Stats

In [47]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [59]:
#Get the country with the minimum population

In [58]:
%%sql
SELECT name
    FROM facts
    WHERE population = (SELECT MIN(population) FROM facts);

Done.

[('Antarctica',)]

In [60]:
#Get the country with the maximum population

In [61]:
%%sql
SELECT name
    FROM facts
    WHERE population = (SELECT MAX(population) FROM facts);

Done.

[('World',)]

In [62]:
#Get the summary stats without the world row

In [50]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts
    WHERE name is NOT 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [63]:
#Get the average area and average population

In [51]:
%%sql
SELECT AVG(population), AVG(area)
    FROM facts;

Done.

[(62094928.32231405, 555093.546184739)]

In [64]:
#Get countries with a population above average and an area below average

In [52]:
%%sql
SELECT name
    FROM facts
    WHERE population > (SELECT avg(population) FROM facts)
    AND area < (SELECT avg(area) FROM facts);

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]